app/controllers/photo_shouts_controller.rb

                      def create
                      content = build_content
                      shout = current_user.shouts.build(content: content)
                          if shout.save
---
INSERT INTO "shouts" ("content_id", "content_type", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content_id", 1], ["content_type", "PhotoShout"], ["created_at", "2014-08-15 03:18:01.349299"], ["updated_at", "2014-08-15 03:18:01.349299"], ["user_id", 1]]