app/controllers/shouts_controller.rb

           def create
              shout = current_user.shouts.build(shout_parameters)
              if shout.save
---
INSERT INTO "shouts" ("body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["body", "hello"], ["created_at", "2014-08-13 22:55:43.563176"], ["updated_at", "2014-08-13 22:55:43.563176"], ["user_id", 1]]

    def show
        @shout = Shout.find(params[:id])
---
SELECT  "shouts".* FROM "shouts"  WHERE "shouts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 3]]